//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯОткрываюСписок(Парам01)","ЯОткрываюСписок","Когда Я открываю список ""ИмяЭлементаСписка""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДобавляюНовыйЭлемент()","ДобавляюНовыйЭлемент","И Добавляю новый элемент");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НажимаюКнопку(Парам01)","НажимаюКнопку","И нажимаю кнопку ""Записать и закрыть""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЗакрываюФормуСписка()","ЯЗакрываюФормуСписка","Тогда я закрываю форму списка");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//И Добавляю новый элемент
//@ДобавляюНовыйЭлемент()
Процедура ДобавляюНовыйЭлемент() Экспорт
	Контекст.ГлавноеОкноТестКлиента.ВыполнитьКоманду("e1cib/command/Справочник.Номенклатура.Команда.Создать");
	Если НЕ КонтекстСохраняемый.ТестовоеПриложение.ОжидатьОтображениеОбъекта(Тип("ТестируемаяФорма"), "Номенклатура*") Тогда
	   ВызватьИсключение "Не удалось открыть форму новой номенклатуры в течение 60 секунд.";
   КонецЕсли;
   ФормаНовогоТовара = КонтекстСохраняемый.ТестовоеПриложение.НайтиОбъект(Тип("ТестируемаяФорма"), "Номенклатура*");
   Контекст.Вставить("ФормаНовогоТовара", ФормаНовогоТовара);
КонецПроцедуры

&НаКлиенте
//И нажимаю кнопку "Записать и закрыть"
//@НажимаюКнопку(Парам01)
Процедура НажимаюКнопку(Парам01) Экспорт
	ФормаНовогоТовара = Контекст.ФормаНовогоТовара;
	КнопкаЗаписатьИЗакрыть = ФормаНовогоТовара.НайтиОбъект(Тип("ТестируемаяКнопкаФормы"), "Записать и закрыть");
	КнопкаЗаписатьИЗакрыть.Нажать();
   // Если НЕ КонтекстСохраняемый.ТестовоеПриложение.ОжидатьОтображениеОбъекта(Тип("ТестируемаяФорма"), "Номенклатура") Тогда
   //    ВызватьИсключение "Не удалось закрыть форму создания новой номенклатуры в течение 60 секунд.";
   //КонецЕсли;	
КонецПроцедуры

&НаКлиенте
//Тогда я закрываю форму списка
//@ЯЗакрываюФормуСписка()
Процедура ЯЗакрываюФормуСписка() Экспорт
   ФормаСпискаНоменклатуры = КонтекстСохраняемый.ТестовоеПриложение.НайтиОбъект(Тип("ТестируемоеОкноКлиентскогоПриложения"), "Номенклатура");	
   ФормаСпискаНоменклатуры.Закрыть();
КонецПроцедуры

//окончание текста модуля

&НаКлиенте
//Когда Я открываю список "ИмяЭлементаСписка"
//@ЯОткрываюСписок(Парам01)
Процедура ЯОткрываюСписок(ИмяЭлементаСписка) Экспорт
	ГлавноеОкноТестКлиента = КонтекстСохраняемый.ТестовоеПриложение.НайтиОбъект(Тип("ТестируемоеОкноКлиентскогоПриложения"), "Block4*");
	ГлавноеОкноТестКлиента.ВыполнитьКоманду("e1cib/list/"+ИмяЭлементаСписка);
	Контекст.Вставить("ГлавноеОкноТестКлиента", ГлавноеОкноТестКлиента);
КонецПроцедуры
